burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_can.c
/*!
    \file    gd32m53x_can.c
    \brief   CAN driver

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32m53x_can.h"

/*!
    \brief      deinitialize CAN (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void can_deinit(void)
{
    rcu_periph_reset_enable(RCU_CANRST);
    rcu_periph_reset_disable(RCU_CANRST);
}

/*!
    \brief      initialize CAN parameter struct with a default value (API_ID(0x0002U))
    \param[in]  type: the type of CAN parameter struct
                only one parameter can be selected which is shown as below:
      \arg        CAN_INIT_STRUCT: the CAN initial struct
      \arg        CAN_FILTER_STRUCT: the CAN filter struct
      \arg        CAN_TX_MESSAGE_STRUCT: the CAN TX message struct
      \arg        CAN_RX_MESSAGE_STRUCT: the CAN RX message struct
    \param[out] p_struct: the pointer of the specific struct
    \retval     none
*/
void can_struct_para_init(can_struct_type_enum type, void *p_struct)
{
    uint8_t i;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(p_struct)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get type of the struct */
        switch(type) {
        /* used for can_init() */
        case CAN_INIT_STRUCT:
            ((can_parameter_struct *)p_struct)->auto_bus_off_recovery = DISABLE;
            ((can_parameter_struct *)p_struct)->auto_retrans = DISABLE;
            ((can_parameter_struct *)p_struct)->auto_wake_up = DISABLE;
            ((can_parameter_struct *)p_struct)->prescaler = 0x03FFU;
            ((can_parameter_struct *)p_struct)->rec_fifo_overwrite = DISABLE;
            ((can_parameter_struct *)p_struct)->resync_jump_width = CAN_BT_SJW_1TQ;
            ((can_parameter_struct *)p_struct)->time_segment_1 = CAN_BT_BS1_3TQ;
            ((can_parameter_struct *)p_struct)->time_segment_2 = CAN_BT_BS2_1TQ;
            ((can_parameter_struct *)p_struct)->time_triggered = DISABLE;
            ((can_parameter_struct *)p_struct)->trans_fifo_order = DISABLE;
            ((can_parameter_struct *)p_struct)->working_mode = CAN_NORMAL_MODE;
            ((can_parameter_struct *)p_struct)->frame_inter_to_id  = ENABLE;
            ((can_parameter_struct *)p_struct)->sample_bit_select  = CAN_TWO_CYCLE;
            ((can_parameter_struct *)p_struct)->bit_sample_mode  = CAN_ONE_SAMPLE;

            break;
        /* used for can_filter_init() */
        case CAN_FILTER_STRUCT:
            ((can_filter_parameter_struct *)p_struct)->filter_bits = CAN_FILTERBITS_32BIT;
            ((can_filter_parameter_struct *)p_struct)->filter_enable = DISABLE;
            ((can_filter_parameter_struct *)p_struct)->filter_fifo_number = CAN_FIFO0;
            ((can_filter_parameter_struct *)p_struct)->filter_list_high = 0x0000U;
            ((can_filter_parameter_struct *)p_struct)->filter_list_low = 0x0000U;
            ((can_filter_parameter_struct *)p_struct)->filter_mask_high = 0x0000U;
            ((can_filter_parameter_struct *)p_struct)->filter_mask_low = 0x0000U;
            ((can_filter_parameter_struct *)p_struct)->filter_mode = CAN_FILTERMODE_MASK;
            ((can_filter_parameter_struct *)p_struct)->filter_number = 0U;

            break;
        /* used for can_message_transmit() */
        case CAN_TX_MESSAGE_STRUCT:
            for(i = 0U; i < 8U; i++) {
                ((can_transmit_message_struct *)p_struct)->tx_data[i] = 0U;
            }

            ((can_transmit_message_struct *)p_struct)->tx_dlen = 0u;
            ((can_transmit_message_struct *)p_struct)->tx_efid = 0U;
            ((can_transmit_message_struct *)p_struct)->tx_ff = (uint8_t)CAN_FF_STANDARD;
            ((can_transmit_message_struct *)p_struct)->tx_ft = (uint8_t)CAN_FT_DATA;
            ((can_transmit_message_struct *)p_struct)->tx_sfid = 0U;

            break;
        /* used for can_message_receive() */
        case CAN_RX_MESSAGE_STRUCT:
            for(i = 0U; i < 8U; i++) {
                ((can_receive_message_struct *)p_struct)->rx_data[i] = 0U;
            }

            ((can_receive_message_struct *)p_struct)->rx_dlen = 0U;
            ((can_receive_message_struct *)p_struct)->rx_efid = 0U;
            ((can_receive_message_struct *)p_struct)->rx_ff = (uint8_t)CAN_FF_STANDARD;
            ((can_receive_message_struct *)p_struct)->rx_fi = 0U;
            ((can_receive_message_struct *)p_struct)->rx_ft = (uint8_t)CAN_FT_DATA;
            ((can_receive_message_struct *)p_struct)->rx_sfid = 0U;

            break;

        default:
            break;
        }
    }
}

/*!
    \brief      initialize CAN (API_ID(0x0003U))
    \param[in]  can_parameter_init: parameters for CAN initialization
      \arg        working_mode: CAN_NORMAL_MODE, CAN_LOOPBACK_MODE, CAN_SILENT_MODE, CAN_SILENT_LOOPBACK_MODE
      \arg        resync_jump_width: CAN_BT_SJW_xTQ(x=1, 2, 3, 4)
      \arg        time_segment_1: CAN_BT_BS1_xTQ(1..16)
      \arg        time_segment_2: CAN_BT_BS2_xTQ(1..8)
      \arg        bit_sample_mode: CAN_THREE_SAMPLE, CAN_ONE_SAMPLE
      \arg        sample_bit_select: CAN_ONE_CYCLE, CAN_TWO_CYCLE
      \arg        frame_inter_to_id: ENABLE or DISABLE
      \arg        time_triggered: ENABLE or DISABLE
      \arg        auto_bus_off_recovery: ENABLE or DISABLE
      \arg        auto_wake_up: ENABLE or DISABLE
      \arg        auto_retrans: ENABLE or DISABLE
      \arg        rec_fifo_overwrite: ENABLE or DISABLE
      \arg        trans_fifo_order: ENABLE or DISABLE
      \arg        prescaler: 0x0001 - 0x0400
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus can_init(can_parameter_struct *can_parameter_init)
{
    uint32_t timeout = CAN_TIMEOUT;
    ErrStatus flag = ERROR;

