burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_can.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(can_parameter_init)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* disable sleep mode */
        CAN_CTL &= ~CAN_CTL_SLPWMOD;
        /* enable initialize mode */
        CAN_CTL |= CAN_CTL_IWMOD;
        /* wait ACK */
        while((CAN_STAT_IWS != (CAN_STAT & CAN_STAT_IWS)) && (0U != timeout)) {
            timeout--;
        }
        /* check initialize working success */
        if(CAN_STAT_IWS != (CAN_STAT & CAN_STAT_IWS)) {
            flag = ERROR;
        } else {
            /* set the bit timing register */
            CAN_BT = (BT_MODE((uint32_t)can_parameter_init->working_mode) | \
                      BT_SJW((uint32_t)can_parameter_init->resync_jump_width) | \
                      BT_BS1((uint32_t)can_parameter_init->time_segment_1) | \
                      BT_BS2((uint32_t)can_parameter_init->time_segment_2) | \
                      BT_BAUDPSC(((uint32_t)(can_parameter_init->prescaler) - 1U)));

            /* time trigger communication mode */
            if(ENABLE == can_parameter_init->time_triggered) {
                CAN_CTL |= CAN_CTL_TTC;
            } else {
                CAN_CTL &= ~CAN_CTL_TTC;
            }
            /* automatic bus-off management */
            if(ENABLE == can_parameter_init->auto_bus_off_recovery) {
                CAN_CTL |= CAN_CTL_ABOR;
            } else {
                CAN_CTL &= ~CAN_CTL_ABOR;
            }
            /* automatic wakeup mode */
            if(ENABLE == can_parameter_init->auto_wake_up) {
                CAN_CTL |= CAN_CTL_AWU;
            } else {
                CAN_CTL &= ~CAN_CTL_AWU;
            }
            /* automatic retransmission mode */
            if(ENABLE == can_parameter_init->auto_retrans) {
                CAN_CTL &= ~CAN_CTL_ARD;
            } else {
                CAN_CTL |= CAN_CTL_ARD;
            }
            /* receive FIFO overwrite mode */
            if(ENABLE == can_parameter_init->rec_fifo_overwrite) {
                CAN_CTL &= ~CAN_CTL_RFOD;
            } else {
                CAN_CTL |= CAN_CTL_RFOD;
            }
            /* transmit FIFO order */
            if(ENABLE == can_parameter_init->trans_fifo_order) {
                CAN_CTL |= CAN_CTL_TFO;
            } else {
                CAN_CTL &= ~CAN_CTL_TFO;
            }
            /* frame inter to identifier Enable */
            if(ENABLE == can_parameter_init->frame_inter_to_id) {
                CAN_CTL |= CAN_CTL_FIIDE;
            } else {
                CAN_CTL &= ~CAN_CTL_FIIDE;
            }
            /* sample bit mode */
            if(CAN_THREE_SAMPLE == can_parameter_init->bit_sample_mode) {
                CAN_CTL |= CAN_CTL_BSPMOD;
            } else {
                CAN_CTL &= ~CAN_CTL_BSPMOD;
            }
            /* bit sampling synchronization select */
            if(CAN_TWO_CYCLE == can_parameter_init->sample_bit_select) {
                CAN_CTL |= CAN_CTL_BSSSEL;
            } else {
                CAN_CTL &= ~CAN_CTL_BSSSEL;
            }
            /* disable initialize mode */
            CAN_CTL &= ~CAN_CTL_IWMOD;
            timeout = CAN_TIMEOUT;
            /* wait the ACK */
            while((CAN_STAT_IWS == (CAN_STAT & CAN_STAT_IWS)) && (0U != timeout)) {
                timeout--;
            }
            /* check exit initialize mode */
            if(0U != timeout) {
                flag = SUCCESS;
            }
        }
    }
    return flag;
}

/*!
    \brief      initialize CAN filter (API_ID(0x0004U))
    \param[in]  can_filter_parameter_init: struct for CAN filter initialization
      \arg        filter_list_high: 0x0000 - 0xFFFF
      \arg        filter_list_low: 0x0000 - 0xFFFF
      \arg        filter_mask_high: 0x0000 - 0xFFFF
      \arg        filter_mask_low: 0x0000 - 0xFFFF
      \arg        filter_fifo_number: CAN_FIFO0, CAN_FIFO1
      \arg        filter_number: 0 - 27
      \arg        filter_mode: CAN_FILTERMODE_MASK, CAN_FILTERMODE_LIST
      \arg        filter_bits: CAN_FILTERBITS_32BIT, CAN_FILTERBITS_16BIT
      \arg        filter_enable: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void can_filter_init(can_filter_parameter_struct *can_filter_parameter_init)
{
    uint32_t val = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(can_filter_parameter_init)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        val = ((uint32_t)1) << (can_filter_parameter_init->filter_number);
        /* filter lock disable */
        CAN_FCTL |= CAN_FCTL_FLD;
        /* disable filter */
        CAN_FW &= ~(uint32_t)val;

        /* filter 16 bits */
        if(CAN_FILTERBITS_16BIT == can_filter_parameter_init->filter_bits) {
            /* set filter 16 bits */
            CAN_FSCFG &= ~(uint32_t)val;
            /* first 16 bits list and first 16 bits mask or first 16 bits list and second 16 bits list */
            CAN_FDATA0(can_filter_parameter_init->filter_number) = \
                                                                   FDATA_MASK_HIGH((can_filter_parameter_init->filter_mask_low) & CAN_FILTER_MASK_16BITS) | \
                                                                   FDATA_MASK_LOW((can_filter_parameter_init->filter_list_low) & CAN_FILTER_MASK_16BITS);
            /* second 16 bits list and second 16 bits mask or third 16 bits list and fourth 16 bits list */
            CAN_FDATA1(can_filter_parameter_init->filter_number) = \
                                                                   FDATA_MASK_HIGH((can_filter_parameter_init->filter_mask_high) & CAN_FILTER_MASK_16BITS) | \
                                                                   FDATA_MASK_LOW((can_filter_parameter_init->filter_list_high) & CAN_FILTER_MASK_16BITS);
        }
        /* filter 32 bits */
        if(CAN_FILTERBITS_32BIT == can_filter_parameter_init->filter_bits) {
            /* set filter 32 bits */
            CAN_FSCFG |= (uint32_t)val;
            /* 32 bits list or first 32 bits list */
            CAN_FDATA0(can_filter_parameter_init->filter_number) = \
                                                                   FDATA_MASK_HIGH((can_filter_parameter_init->filter_list_high) & CAN_FILTER_MASK_16BITS) |
                                                                   FDATA_MASK_LOW((can_filter_parameter_init->filter_list_low) & CAN_FILTER_MASK_16BITS);
            /* 32 bits mask or second 32 bits list */
            CAN_FDATA1(can_filter_parameter_init->filter_number) = \
                                                                   FDATA_MASK_HIGH((can_filter_parameter_init->filter_mask_high) & CAN_FILTER_MASK_16BITS) |
                                                                   FDATA_MASK_LOW((can_filter_parameter_init->filter_mask_low) & CAN_FILTER_MASK_16BITS);
        }

        /* filter mode */
        if(CAN_FILTERMODE_MASK == can_filter_parameter_init->filter_mode) {
            /* mask mode */
            CAN_FMCFG &= ~(uint32_t)val;
        } else {
            /* list mode */
            CAN_FMCFG |= (uint32_t)val;
        }

        /* filter FIFO */
        if(CAN_FIFO0 == (can_filter_parameter_init->filter_fifo_number)) {
            /* FIFO0 */
            CAN_FAFIFO &= ~(uint32_t)val;
        } else {
            /* FIFO1 */
            CAN_FAFIFO |= (uint32_t)val;
        }

        /* filter working */
        if(ENABLE == can_filter_parameter_init->filter_enable) {

            CAN_FW |= (uint32_t)val;
        }

        /* filter lock enable */
        CAN_FCTL &= ~CAN_FCTL_FLD;
    }
}

/*!
    \brief      enable CAN debug freeze (API_ID(0x0005U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void can_debug_freeze_enable(void)
{
    /* set DFZ bit */
    CAN_CTL |= CAN_CTL_DFZ;
    dbg_periph_enable(DBG_CAN_HOLD);
}

/*!
    \brief      disable CAN debug freeze (API_ID(0x0006U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void can_debug_freeze_disable(void)
{
    /* set DFZ bit */
    CAN_CTL &= ~CAN_CTL_DFZ;
    dbg_periph_disable(DBG_CAN_HOLD);
}

/*!
    \brief      enable CAN time trigger mode (API_ID(0x0007U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void can_time_trigger_mode_enable(void)
{
    uint8_t mailbox_number;

    /* enable the TTC mode */
    CAN_CTL |= CAN_CTL_TTC;
    /* enable time stamp */
    for(mailbox_number = 0U; mailbox_number < 3U; mailbox_number++) {
        CAN_TMP(mailbox_number) |= CAN_TMP_TSEN;
    }
}

/*!
    \brief      disable CAN time trigger mode (API_ID(0x0008U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void can_time_trigger_mode_disable(void)
{
    uint8_t mailbox_number;

    /* disable the TTC mode */
    CAN_CTL &= ~CAN_CTL_TTC;
    /* reset TSEN bits */
    for(mailbox_number = 0U; mailbox_number < 3U; mailbox_number++) {
        CAN_TMP(mailbox_number) &= ~CAN_TMP_TSEN;
    }
}

/*!
    \brief      transmit CAN message (API_ID(0x0009U))
    \param[in]  transmit_message: struct for CAN transmit message
      \arg        tx_sfid: 0x00000000 - 0x000007FF
      \arg        tx_efid: 0x00000000 - 0x1FFFFFFF
      \arg        tx_ff: CAN_FF_STANDARD, CAN_FF_EXTENDED
      \arg        tx_ft: CAN_FT_DATA, CAN_FT_REMOTE
      \arg        tx_dlen: 0 - 8
      \arg        tx_data[]: 0x00 - 0xFF
    \param[out] none
    \retval     mailbox_number
*/
uint8_t can_message_transmit(can_transmit_message_struct *transmit_message)
{
    uint8_t mailbox_number = CAN_NOMAILBOX;

