burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_can.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(transmit_message)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* select one empty mailbox */
        if(CAN_TSTAT_TME0 == (CAN_TSTAT & CAN_TSTAT_TME0)) {
            mailbox_number = CAN_MAILBOX0;
        } else if(CAN_TSTAT_TME1 == (CAN_TSTAT & CAN_TSTAT_TME1)) {
            mailbox_number = CAN_MAILBOX1;
        } else if(CAN_TSTAT_TME2 == (CAN_TSTAT & CAN_TSTAT_TME2)) {
            mailbox_number = CAN_MAILBOX2;
        } else {
            mailbox_number = CAN_NOMAILBOX;
        }
        /* return no mailbox empty */
        if(CAN_NOMAILBOX != mailbox_number) {
            CAN_TMI(mailbox_number) &= CAN_TMI_TEN;
            if(CAN_FF_STANDARD == transmit_message->tx_ff) {
                /* set transmit mailbox standard identifier */
                CAN_TMI(mailbox_number) |= (uint32_t)(TMI_SFID(transmit_message->tx_sfid) | \
                                                      transmit_message->tx_ft);
            } else {
                /* set transmit mailbox extended identifier */
                CAN_TMI(mailbox_number) |= (uint32_t)(TMI_EFID(transmit_message->tx_efid) | \
                                                      transmit_message->tx_ff | \
                                                      transmit_message->tx_ft);
            }
            /* set the data length */
            CAN_TMP(mailbox_number) &= ~CAN_TMP_DLENC;

            /* Classic CAN frame data length does not exceed 8 */
            if(transmit_message->tx_dlen > 8U) {
                transmit_message->tx_dlen = 8U;
            }

            CAN_TMP(mailbox_number) |= transmit_message->tx_dlen;
            /* set the data */
            CAN_TMDATA0(mailbox_number) = TMDATA0_DB3(transmit_message->tx_data[3]) | \
                                          TMDATA0_DB2(transmit_message->tx_data[2]) | \
                                          TMDATA0_DB1(transmit_message->tx_data[1]) | \
                                          TMDATA0_DB0(transmit_message->tx_data[0]);
            CAN_TMDATA1(mailbox_number) = TMDATA1_DB7(transmit_message->tx_data[7]) | \
                                          TMDATA1_DB6(transmit_message->tx_data[6]) | \
                                          TMDATA1_DB5(transmit_message->tx_data[5]) | \
                                          TMDATA1_DB4(transmit_message->tx_data[4]);
            /* enable transmission */
            CAN_TMI(mailbox_number) |= CAN_TMI_TEN;
        }
    }

    return mailbox_number;
}

/*!
    \brief      get CAN transmit state (API_ID(0x000AU))
    \param[in]  mailbox_number
                only one parameter can be selected which is shown as below:
      \arg        CAN_MAILBOXx(x=0,1,2)
    \param[out] none
    \retval     can_transmit_state_enum
*/
can_transmit_state_enum can_transmit_states(uint8_t mailbox_number)
{
    can_transmit_state_enum state = CAN_TRANSMIT_FAILED;
    uint32_t val = 0U;

    /* check selected mailbox state */
    switch(mailbox_number) {
    /* mailbox0 */
    case CAN_MAILBOX0:
        val = CAN_TSTAT & (CAN_TSTAT_MTF0 | CAN_TSTAT_MTFNERR0 | CAN_TSTAT_TME0);
        break;
    /* mailbox1 */
    case CAN_MAILBOX1:
        val = CAN_TSTAT & (CAN_TSTAT_MTF1 | CAN_TSTAT_MTFNERR1 | CAN_TSTAT_TME1);
        break;
    /* mailbox2 */
    case CAN_MAILBOX2:
        val = CAN_TSTAT & (CAN_TSTAT_MTF2 | CAN_TSTAT_MTFNERR2 | CAN_TSTAT_TME2);
        break;
    default:
        val = CAN_TRANSMIT_FAILED;
        break;
    }

    switch(val) {
    /* transmit pending */
    case(CAN_STATE_PENDING):
        state = CAN_TRANSMIT_PENDING;
        break;
    /* mailbox0 transmit succeeded */
    case(CAN_TSTAT_MTF0 | CAN_TSTAT_MTFNERR0 | CAN_TSTAT_TME0):
        state = CAN_TRANSMIT_OK;
        break;
    /* mailbox1 transmit succeeded */
    case(CAN_TSTAT_MTF1 | CAN_TSTAT_MTFNERR1 | CAN_TSTAT_TME1):
        state = CAN_TRANSMIT_OK;
        break;
    /* mailbox2 transmit succeeded */
    case(CAN_TSTAT_MTF2 | CAN_TSTAT_MTFNERR2 | CAN_TSTAT_TME2):
        state = CAN_TRANSMIT_OK;
        break;
    /* transmit failed */
    default:
        state = CAN_TRANSMIT_FAILED;
        break;
    }

    return state;
}

/*!
    \brief      stop CAN transmission (API_ID(0x000BU))
    \param[in]  mailbox_number
                only one parameter can be selected which is shown as below:
      \arg        CAN_MAILBOXx(x=0,1,2)
    \param[out] none
    \retval     none
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus can_transmission_stop(uint8_t mailbox_number)
{
    ErrStatus reval = SUCCESS;
    /* timeout for CAN_TSTAT_MSTx bits */
    uint32_t timeout = CAN_TIMEOUT;
    uint32_t reg_value0 = 0U;
    uint32_t reg_value1 = 0U;

    /* get the status of transmit FIFO order */
    reg_value0 = CAN_CTL & CAN_CTL_TFO;

    if(CAN_MAILBOX0 == mailbox_number) {
        reg_value1 = CAN_TSTAT & (CAN_TSTAT_TMLS0 | CAN_ALL_MAILBOX_EMPTY);
        if((CAN_CTL_TFO == reg_value0) && (CAN_TSTAT_TMLS0 == reg_value1)){
            reval = ERROR;
        } else {
            CAN_TSTAT |= CAN_TSTAT_MST0;
            while((CAN_TSTAT_MST0 == (CAN_TSTAT & CAN_TSTAT_MST0)) && (0U != timeout)) {
                timeout--;
            }
            if(CAN_TSTAT_MST0 == (CAN_TSTAT & CAN_TSTAT_MST0)){
                reval = ERROR;
            }
        }
    } else if(CAN_MAILBOX1 == mailbox_number) {
        reg_value1 = CAN_TSTAT & (CAN_TSTAT_TMLS1 | CAN_ALL_MAILBOX_EMPTY);
        if((CAN_CTL_TFO == reg_value0) && (CAN_TSTAT_TMLS1 == reg_value1)){
            reval = ERROR;
        }else{
            CAN_TSTAT |= CAN_TSTAT_MST1;
            while((CAN_TSTAT_MST1 == (CAN_TSTAT & CAN_TSTAT_MST1)) && (0U != timeout)) {
                timeout--;
            }
            if(CAN_TSTAT_MST1 == (CAN_TSTAT & CAN_TSTAT_MST1)){
                reval = ERROR;
            }
        }

    } else if(CAN_MAILBOX2 == mailbox_number) {
        reg_value1 = CAN_TSTAT & (CAN_TSTAT_TMLS2 | CAN_ALL_MAILBOX_EMPTY);
        if((CAN_CTL_TFO == reg_value0) && (CAN_TSTAT_TMLS2 == reg_value1)){
            reval = ERROR;
        }else{
            CAN_TSTAT |= CAN_TSTAT_MST2;
            while((CAN_TSTAT_MST2 == (CAN_TSTAT & CAN_TSTAT_MST2)) && (0U != timeout)) {
                timeout--;
            }
            if(CAN_TSTAT_MST2 == (CAN_TSTAT & CAN_TSTAT_MST2)){
                reval = ERROR;
            }
        }
    } else {
        /* illegal parameters */
    }
    return reval;
}

/*!
    \brief      CAN receive message (API_ID(0x000CU))
    \param[in]  fifo_number
                only one parameter can be selected which is shown as below:
      \arg        CAN_FIFOx(x=0,1)
    \param[out] receive_message: struct for CAN receive message
      \arg        rx_sfid: 0x00000000 - 0x000007FF
      \arg        rx_efid: 0x00000000 - 0x1FFFFFFF
      \arg        rx_ff: CAN_FF_STANDARD, CAN_FF_EXTENDED
      \arg        rx_ft: CAN_FT_DATA, CAN_FT_REMOTE
      \arg        rx_dlen: 0 - 8
      \arg        rx_data[]: 0x00 - 0xFF
      \arg        rx_fi: 0 - 27
    \retval     none
*/
void can_message_receive(uint8_t fifo_number, can_receive_message_struct *receive_message)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(receive_message)) {
        fw_debug_report_err(CAN_MODULE_ID, API_ID(0x000CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the frame format */
        receive_message->rx_ff = (uint8_t)(CAN_RFIFOMI_FF & CAN_RFIFOMI(fifo_number));
        if(CAN_FF_STANDARD == receive_message->rx_ff) {
            /* get standard identifier */
            receive_message->rx_sfid = (uint32_t)(GET_RFIFOMI_SFID(CAN_RFIFOMI(fifo_number)));
        } else {
            /* get extended identifier */
            receive_message->rx_efid = (uint32_t)(GET_RFIFOMI_EFID(CAN_RFIFOMI(fifo_number)));
        }

        /* get frame type */
        receive_message->rx_ft = (uint8_t)(CAN_RFIFOMI_FT & CAN_RFIFOMI(fifo_number));
        /* filtering index */
        receive_message->rx_fi = (uint8_t)(GET_RFIFOMP_FI(CAN_RFIFOMP(fifo_number)));
        /* get receive data length */
        receive_message->rx_dlen = (uint8_t)(GET_RFIFOMP_DLENC(CAN_RFIFOMP(fifo_number)));

